zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/ssc.h
/**
 * \brief Component description for PIC32CZ/CA70 SSC
 *
 * Copyright (c) 2017 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2017-07-14T18:00:00Z */
#ifndef _PIC32CZ_CA70_SSC_COMPONENT_H_
#define _PIC32CZ_CA70_SSC_COMPONENT_H_

/** \addtogroup PIC32CZ_CA70_SSC Synchronous Serial Controller
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR SSC */
/* ========================================================================== */

/* -------- SSC_CR : (SSC Offset: 0x00) (/W 32) Control Register -------- */

typedef union
{
  struct
  {
    uint32_t RXEN:1;                    /**< bit:      0  Receive Enable                                */
    uint32_t RXDIS:1;                   /**< bit:      1  Receive Disable                               */
    uint32_t :6;                        /**< bit:   2..7  Reserved                                      */
    uint32_t TXEN:1;                    /**< bit:      8  Transmit Enable                               */
    uint32_t TXDIS:1;                   /**< bit:      9  Transmit Disable                              */
    uint32_t :5;                        /**< bit: 10..14  Reserved                                      */
    uint32_t SWRST:1;                   /**< bit:     15  Software Reset                                */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __SSC_CR_bits_t;

#define SSC_CR_RXEN_Pos                       (0)                                            /**< (SSC_CR) Receive Enable Position */
#define SSC_CR_RXEN_Msk                       (0x1U << SSC_CR_RXEN_Pos)                      /**< (SSC_CR) Receive Enable Mask */
#define SSC_CR_RXDIS_Pos                      (1)                                            /**< (SSC_CR) Receive Disable Position */
#define SSC_CR_RXDIS_Msk                      (0x1U << SSC_CR_RXDIS_Pos)                     /**< (SSC_CR) Receive Disable Mask */
#define SSC_CR_TXEN_Pos                       (8)                                            /**< (SSC_CR) Transmit Enable Position */
#define SSC_CR_TXEN_Msk                       (0x1U << SSC_CR_TXEN_Pos)                      /**< (SSC_CR) Transmit Enable Mask */
#define SSC_CR_TXDIS_Pos                      (9)                                            /**< (SSC_CR) Transmit Disable Position */
#define SSC_CR_TXDIS_Msk                      (0x1U << SSC_CR_TXDIS_Pos)                     /**< (SSC_CR) Transmit Disable Mask */
#define SSC_CR_SWRST_Pos                      (15)                                           /**< (SSC_CR) Software Reset Position */
#define SSC_CR_SWRST_Msk                      (0x1U << SSC_CR_SWRST_Pos)                     /**< (SSC_CR) Software Reset Mask */
#define SSC_CR_Msk                            (0x00008303UL)                                 /**< (SSC_CR) Register Mask  */

/* -------- SSC_CMR : (SSC Offset: 0x04) (R/W 32) Clock Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t DIV:12;                    /**< bit:  0..11  Clock Divider                                 */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  uint32_t w;
} __SSC_CMR_bits_t;

#define SSC_CMR_DIV_Pos                       (0)                                            /**< (SSC_CMR) Clock Divider Position */
#define SSC_CMR_DIV_Msk                       (0xFFFU << SSC_CMR_DIV_Pos)                    /**< (SSC_CMR) Clock Divider Mask */
#define SSC_CMR_DIV(value)                    (SSC_CMR_DIV_Msk & ((value) << SSC_CMR_DIV_Pos))
#define SSC_CMR_Msk                           (0x00000FFFUL)                                 /**< (SSC_CMR) Register Mask  */

/* -------- SSC_RCMR : (SSC Offset: 0x10) (R/W 32) Receive Clock Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t CKS:2;                     /**< bit:   0..1  Receive Clock Selection                       */
    uint32_t CKO:3;                     /**< bit:   2..4  Receive Clock Output Mode Selection           */
    uint32_t CKI:1;                     /**< bit:      5  Receive Clock Inversion                       */
    uint32_t CKG:2;                     /**< bit:   6..7  Receive Clock Gating Selection                */
    uint32_t START:4;                   /**< bit:  8..11  Receive Start Selection                       */
    uint32_t STOP:1;                    /**< bit:     12  Receive Stop Selection                        */
    uint32_t :3;                        /**< bit: 13..15  Reserved                                      */
    uint32_t STTDLY:8;                  /**< bit: 16..23  Receive Start Delay                           */
    uint32_t PERIOD:8;                  /**< bit: 24..31  Receive Period Divider Selection              */
  };
  uint32_t w;
} __SSC_RCMR_bits_t;

#define SSC_RCMR_CKS_Pos                      (0)                                            /**< (SSC_RCMR) Receive Clock Selection Position */
#define SSC_RCMR_CKS_Msk                      (0x3U << SSC_RCMR_CKS_Pos)                     /**< (SSC_RCMR) Receive Clock Selection Mask */
#define SSC_RCMR_CKS(value)                   (SSC_RCMR_CKS_Msk & ((value) << SSC_RCMR_CKS_Pos))
#define   SSC_RCMR_CKS_MCK_Val                (0x0U)                                         /**< (SSC_RCMR) Divided Clock  */
#define   SSC_RCMR_CKS_TK_Val                 (0x1U)                                         /**< (SSC_RCMR) TK Clock signal  */
#define   SSC_RCMR_CKS_RK_Val                 (0x2U)                                         /**< (SSC_RCMR) RK pin  */
#define SSC_RCMR_CKS_MCK                      (SSC_RCMR_CKS_MCK_Val << SSC_RCMR_CKS_Pos)     /**< (SSC_RCMR) Divided Clock Position  */
#define SSC_RCMR_CKS_TK                       (SSC_RCMR_CKS_TK_Val << SSC_RCMR_CKS_Pos)      /**< (SSC_RCMR) TK Clock signal Position  */
#define SSC_RCMR_CKS_RK                       (SSC_RCMR_CKS_RK_Val << SSC_RCMR_CKS_Pos)      /**< (SSC_RCMR) RK pin Position  */
#define SSC_RCMR_CKO_Pos                      (2)                                            /**< (SSC_RCMR) Receive Clock Output Mode Selection Position */
#define SSC_RCMR_CKO_Msk                      (0x7U << SSC_RCMR_CKO_Pos)                     /**< (SSC_RCMR) Receive Clock Output Mode Selection Mask */
#define SSC_RCMR_CKO(value)                   (SSC_RCMR_CKO_Msk & ((value) << SSC_RCMR_CKO_Pos))
#define   SSC_RCMR_CKO_NONE_Val               (0x0U)                                         /**< (SSC_RCMR) None, RK pin is an input  */
#define   SSC_RCMR_CKO_CONTINUOUS_Val         (0x1U)                                         /**< (SSC_RCMR) Continuous Receive Clock, RK pin is an output  */
#define   SSC_RCMR_CKO_TRANSFER_Val           (0x2U)                                         /**< (SSC_RCMR) Receive Clock only during data transfers, RK pin is an output  */
#define SSC_RCMR_CKO_NONE                     (SSC_RCMR_CKO_NONE_Val << SSC_RCMR_CKO_Pos)    /**< (SSC_RCMR) None, RK pin is an input Position  */
#define SSC_RCMR_CKO_CONTINUOUS               (SSC_RCMR_CKO_CONTINUOUS_Val << SSC_RCMR_CKO_Pos)  /**< (SSC_RCMR) Continuous Receive Clock, RK pin is an output Position  */
#define SSC_RCMR_CKO_TRANSFER                 (SSC_RCMR_CKO_TRANSFER_Val << SSC_RCMR_CKO_Pos)  /**< (SSC_RCMR) Receive Clock only during data transfers, RK pin is an output Position  */
#define SSC_RCMR_CKI_Pos                      (5)                                            /**< (SSC_RCMR) Receive Clock Inversion Position */
#define SSC_RCMR_CKI_Msk                      (0x1U << SSC_RCMR_CKI_Pos)                     /**< (SSC_RCMR) Receive Clock Inversion Mask */
#define SSC_RCMR_CKG_Pos                      (6)                                            /**< (SSC_RCMR) Receive Clock Gating Selection Position */
#define SSC_RCMR_CKG_Msk                      (0x3U << SSC_RCMR_CKG_Pos)                     /**< (SSC_RCMR) Receive Clock Gating Selection Mask */
#define SSC_RCMR_CKG(value)                   (SSC_RCMR_CKG_Msk & ((value) << SSC_RCMR_CKG_Pos))
#define   SSC_RCMR_CKG_CONTINUOUS_Val         (0x0U)                                         /**< (SSC_RCMR) None  */
#define   SSC_RCMR_CKG_EN_RF_LOW_Val          (0x1U)                                         /**< (SSC_RCMR) Receive Clock enabled only if RF Low  */
#define   SSC_RCMR_CKG_EN_RF_HIGH_Val         (0x2U)                                         /**< (SSC_RCMR) Receive Clock enabled only if RF High  */
#define SSC_RCMR_CKG_CONTINUOUS               (SSC_RCMR_CKG_CONTINUOUS_Val << SSC_RCMR_CKG_Pos)  /**< (SSC_RCMR) None Position  */
#define SSC_RCMR_CKG_EN_RF_LOW                (SSC_RCMR_CKG_EN_RF_LOW_Val << SSC_RCMR_CKG_Pos)  /**< (SSC_RCMR) Receive Clock enabled only if RF Low Position  */
#define SSC_RCMR_CKG_EN_RF_HIGH               (SSC_RCMR_CKG_EN_RF_HIGH_Val << SSC_RCMR_CKG_Pos)  /**< (SSC_RCMR) Receive Clock enabled only if RF High Position  */
#define SSC_RCMR_START_Pos                    (8)                                            /**< (SSC_RCMR) Receive Start Selection Position */
#define SSC_RCMR_START_Msk                    (0xFU << SSC_RCMR_START_Pos)                   /**< (SSC_RCMR) Receive Start Selection Mask */
#define SSC_RCMR_START(value)                 (SSC_RCMR_START_Msk & ((value) << SSC_RCMR_START_Pos))
#define   SSC_RCMR_START_CONTINUOUS_Val       (0x0U)                                         /**< (SSC_RCMR) Continuous, as soon as the receiver is enabled, and immediately after the end of transfer of the previous data.  */
#define   SSC_RCMR_START_TRANSMIT_Val         (0x1U)                                         /**< (SSC_RCMR) Transmit start  */
#define   SSC_RCMR_START_RF_LOW_Val           (0x2U)                                         /**< (SSC_RCMR) Detection of a low level on RF signal  */
#define   SSC_RCMR_START_RF_HIGH_Val          (0x3U)                                         /**< (SSC_RCMR) Detection of a high level on RF signal  */
#define   SSC_RCMR_START_RF_FALLING_Val       (0x4U)                                         /**< (SSC_RCMR) Detection of a falling edge on RF signal  */
#define   SSC_RCMR_START_RF_RISING_Val        (0x5U)                                         /**< (SSC_RCMR) Detection of a rising edge on RF signal  */
#define   SSC_RCMR_START_RF_LEVEL_Val         (0x6U)                                         /**< (SSC_RCMR) Detection of any level change on RF signal  */
#define   SSC_RCMR_START_RF_EDGE_Val          (0x7U)                                         /**< (SSC_RCMR) Detection of any edge on RF signal  */
#define   SSC_RCMR_START_CMP_0_Val            (0x8U)                                         /**< (SSC_RCMR) Compare 0  */
#define SSC_RCMR_START_CONTINUOUS             (SSC_RCMR_START_CONTINUOUS_Val << SSC_RCMR_START_Pos)  /**< (SSC_RCMR) Continuous, as soon as the receiver is enabled, and immediately after the end of transfer of the previous data. Position  */
#define SSC_RCMR_START_TRANSMIT               (SSC_RCMR_START_TRANSMIT_Val << SSC_RCMR_START_Pos)  /**< (SSC_RCMR) Transmit start Position  */
#define SSC_RCMR_START_RF_LOW                 (SSC_RCMR_START_RF_LOW_Val << SSC_RCMR_START_Pos)  /**< (SSC_RCMR) Detection of a low level on RF signal Position  */
#define SSC_RCMR_START_RF_HIGH                (SSC_RCMR_START_RF_HIGH_Val << SSC_RCMR_START_Pos)  /**< (SSC_RCMR) Detection of a high level on RF signal Position  */
#define SSC_RCMR_START_RF_FALLING             (SSC_RCMR_START_RF_FALLING_Val << SSC_RCMR_START_Pos)  /**< (SSC_RCMR) Detection of a falling edge on RF signal Position  */
#define SSC_RCMR_START_RF_RISING              (SSC_RCMR_START_RF_RISING_Val << SSC_RCMR_START_Pos)  /**< (SSC_RCMR) Detection of a rising edge on RF signal Position  */
#define SSC_RCMR_START_RF_LEVEL               (SSC_RCMR_START_RF_LEVEL_Val << SSC_RCMR_START_Pos)  /**< (SSC_RCMR) Detection of any level change on RF signal Position  */
#define SSC_RCMR_START_RF_EDGE                (SSC_RCMR_START_RF_EDGE_Val << SSC_RCMR_START_Pos)  /**< (SSC_RCMR) Detection of any edge on RF signal Position  */
#define SSC_RCMR_START_CMP_0                  (SSC_RCMR_START_CMP_0_Val << SSC_RCMR_START_Pos)  /**< (SSC_RCMR) Compare 0 Position  */
#define SSC_RCMR_STOP_Pos                     (12)                                           /**< (SSC_RCMR) Receive Stop Selection Position */
#define SSC_RCMR_STOP_Msk                     (0x1U << SSC_RCMR_STOP_Pos)                    /**< (SSC_RCMR) Receive Stop Selection Mask */
#define SSC_RCMR_STTDLY_Pos                   (16)                                           /**< (SSC_RCMR) Receive Start Delay Position */
#define SSC_RCMR_STTDLY_Msk                   (0xFFU << SSC_RCMR_STTDLY_Pos)                 /**< (SSC_RCMR) Receive Start Delay Mask */
#define SSC_RCMR_STTDLY(value)                (SSC_RCMR_STTDLY_Msk & ((value) << SSC_RCMR_STTDLY_Pos))
#define SSC_RCMR_PERIOD_Pos                   (24)                                           /**< (SSC_RCMR) Receive Period Divider Selection Position */
#define SSC_RCMR_PERIOD_Msk                   (0xFFU << SSC_RCMR_PERIOD_Pos)                 /**< (SSC_RCMR) Receive Period Divider Selection Mask */
#define SSC_RCMR_PERIOD(value)                (SSC_RCMR_PERIOD_Msk & ((value) << SSC_RCMR_PERIOD_Pos))
#define SSC_RCMR_Msk                          (0xFFFF1FFFUL)                                 /**< (SSC_RCMR) Register Mask  */

/* -------- SSC_RFMR : (SSC Offset: 0x14) (R/W 32) Receive Frame Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t DATLEN:5;                  /**< bit:   0..4  Data Length                                   */
    uint32_t LOOP:1;                    /**< bit:      5  Loop Mode                                     */
    uint32_t :1;                        /**< bit:      6  Reserved                                      */
    uint32_t MSBF:1;                    /**< bit:      7  Most Significant Bit First                    */
    uint32_t DATNB:4;                   /**< bit:  8..11  Data Number per Frame                         */
    uint32_t :4;                        /**< bit: 12..15  Reserved                                      */
    uint32_t FSLEN:4;                   /**< bit: 16..19  Receive Frame Sync Length                     */
    uint32_t FSOS:3;                    /**< bit: 20..22  Receive Frame Sync Output Selection           */
    uint32_t :1;                        /**< bit:     23  Reserved                                      */
    uint32_t FSEDGE:1;                  /**< bit:     24  Frame Sync Edge Detection                     */
    uint32_t :3;                        /**< bit: 25..27  Reserved                                      */
    uint32_t FSLEN_EXT:4;               /**< bit: 28..31  FSLEN Field Extension                         */
  };
  uint32_t w;
} __SSC_RFMR_bits_t;

#define SSC_RFMR_DATLEN_Pos                   (0)                                            /**< (SSC_RFMR) Data Length Position */
#define SSC_RFMR_DATLEN_Msk                   (0x1FU << SSC_RFMR_DATLEN_Pos)                 /**< (SSC_RFMR) Data Length Mask */
#define SSC_RFMR_DATLEN(value)                (SSC_RFMR_DATLEN_Msk & ((value) << SSC_RFMR_DATLEN_Pos))
#define SSC_RFMR_LOOP_Pos                     (5)                                            /**< (SSC_RFMR) Loop Mode Position */
#define SSC_RFMR_LOOP_Msk                     (0x1U << SSC_RFMR_LOOP_Pos)                    /**< (SSC_RFMR) Loop Mode Mask */
#define SSC_RFMR_MSBF_Pos                     (7)                                            /**< (SSC_RFMR) Most Significant Bit First Position */
#define SSC_RFMR_MSBF_Msk                     (0x1U << SSC_RFMR_MSBF_Pos)                    /**< (SSC_RFMR) Most Significant Bit First Mask */
#define SSC_RFMR_DATNB_Pos                    (8)                                            /**< (SSC_RFMR) Data Number per Frame Position */
#define SSC_RFMR_DATNB_Msk                    (0xFU << SSC_RFMR_DATNB_Pos)                   /**< (SSC_RFMR) Data Number per Frame Mask */
#define SSC_RFMR_DATNB(value)                 (SSC_RFMR_DATNB_Msk & ((value) << SSC_RFMR_DATNB_Pos))
#define SSC_RFMR_FSLEN_Pos                    (16)                                           /**< (SSC_RFMR) Receive Frame Sync Length Position */
#define SSC_RFMR_FSLEN_Msk                    (0xFU << SSC_RFMR_FSLEN_Pos)                   /**< (SSC_RFMR) Receive Frame Sync Length Mask */
#define SSC_RFMR_FSLEN(value)                 (SSC_RFMR_FSLEN_Msk & ((value) << SSC_RFMR_FSLEN_Pos))
#define SSC_RFMR_FSOS_Pos                     (20)                                           /**< (SSC_RFMR) Receive Frame Sync Output Selection Position */
#define SSC_RFMR_FSOS_Msk                     (0x7U << SSC_RFMR_FSOS_Pos)                    /**< (SSC_RFMR) Receive Frame Sync Output Selection Mask */
#define SSC_RFMR_FSOS(value)                  (SSC_RFMR_FSOS_Msk & ((value) << SSC_RFMR_FSOS_Pos))
#define   SSC_RFMR_FSOS_NONE_Val              (0x0U)                                         /**< (SSC_RFMR) None, RF pin is an input  */
#define   SSC_RFMR_FSOS_NEGATIVE_Val          (0x1U)                                         /**< (SSC_RFMR) Negative Pulse, RF pin is an output  */
#define   SSC_RFMR_FSOS_POSITIVE_Val          (0x2U)                                         /**< (SSC_RFMR) Positive Pulse, RF pin is an output  */
#define   SSC_RFMR_FSOS_LOW_Val               (0x3U)                                         /**< (SSC_RFMR) Driven Low during data transfer, RF pin is an output  */
#define   SSC_RFMR_FSOS_HIGH_Val              (0x4U)                                         /**< (SSC_RFMR) Driven High during data transfer, RF pin is an output  */
#define   SSC_RFMR_FSOS_TOGGLING_Val          (0x5U)                                         /**< (SSC_RFMR) Toggling at each start of data transfer, RF pin is an output  */
#define SSC_RFMR_FSOS_NONE                    (SSC_RFMR_FSOS_NONE_Val << SSC_RFMR_FSOS_Pos)  /**< (SSC_RFMR) None, RF pin is an input Position  */
#define SSC_RFMR_FSOS_NEGATIVE                (SSC_RFMR_FSOS_NEGATIVE_Val << SSC_RFMR_FSOS_Pos)  /**< (SSC_RFMR) Negative Pulse, RF pin is an output Position  */
#define SSC_RFMR_FSOS_POSITIVE                (SSC_RFMR_FSOS_POSITIVE_Val << SSC_RFMR_FSOS_Pos)  /**< (SSC_RFMR) Positive Pulse, RF pin is an output Position  */
#define SSC_RFMR_FSOS_LOW                     (SSC_RFMR_FSOS_LOW_Val << SSC_RFMR_FSOS_Pos)   /**< (SSC_RFMR) Driven Low during data transfer, RF pin is an output Position  */
#define SSC_RFMR_FSOS_HIGH                    (SSC_RFMR_FSOS_HIGH_Val << SSC_RFMR_FSOS_Pos)  /**< (SSC_RFMR) Driven High during data transfer, RF pin is an output Position  */
#define SSC_RFMR_FSOS_TOGGLING                (SSC_RFMR_FSOS_TOGGLING_Val << SSC_RFMR_FSOS_Pos)  /**< (SSC_RFMR) Toggling at each start of data transfer, RF pin is an output Position  */
#define SSC_RFMR_FSEDGE_Pos                   (24)                                           /**< (SSC_RFMR) Frame Sync Edge Detection Position */
#define SSC_RFMR_FSEDGE_Msk                   (0x1U << SSC_RFMR_FSEDGE_Pos)                  /**< (SSC_RFMR) Frame Sync Edge Detection Mask */
#define   SSC_RFMR_FSEDGE_POSITIVE_Val        (0x0U)                                         /**< (SSC_RFMR) Positive Edge Detection  */
#define   SSC_RFMR_FSEDGE_NEGATIVE_Val        (0x1U)                                         /**< (SSC_RFMR) Negative Edge Detection  */
#define SSC_RFMR_FSEDGE_POSITIVE              (SSC_RFMR_FSEDGE_POSITIVE_Val << SSC_RFMR_FSEDGE_Pos)  /**< (SSC_RFMR) Positive Edge Detection Position  */
#define SSC_RFMR_FSEDGE_NEGATIVE              (SSC_RFMR_FSEDGE_NEGATIVE_Val << SSC_RFMR_FSEDGE_Pos)  /**< (SSC_RFMR) Negative Edge Detection Position  */
#define SSC_RFMR_FSLEN_EXT_Pos                (28)                                           /**< (SSC_RFMR) FSLEN Field Extension Position */
#define SSC_RFMR_FSLEN_EXT_Msk                (0xFU << SSC_RFMR_FSLEN_EXT_Pos)               /**< (SSC_RFMR) FSLEN Field Extension Mask */
#define SSC_RFMR_FSLEN_EXT(value)             (SSC_RFMR_FSLEN_EXT_Msk & ((value) << SSC_RFMR_FSLEN_EXT_Pos))
#define SSC_RFMR_Msk                          (0xF17F0FBFUL)                                 /**< (SSC_RFMR) Register Mask  */

/* -------- SSC_TCMR : (SSC Offset: 0x18) (R/W 32) Transmit Clock Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t CKS:2;                     /**< bit:   0..1  Transmit Clock Selection                      */
    uint32_t CKO:3;                     /**< bit:   2..4  Transmit Clock Output Mode Selection          */
    uint32_t CKI:1;                     /**< bit:      5  Transmit Clock Inversion                      */
    uint32_t CKG:2;                     /**< bit:   6..7  Transmit Clock Gating Selection               */
    uint32_t START:4;                   /**< bit:  8..11  Transmit Start Selection                      */
    uint32_t :4;                        /**< bit: 12..15  Reserved                                      */
    uint32_t STTDLY:8;                  /**< bit: 16..23  Transmit Start Delay                          */
    uint32_t PERIOD:8;                  /**< bit: 24..31  Transmit Period Divider Selection             */
  };
  uint32_t w;
} __SSC_TCMR_bits_t;

