zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/ssc.h
#define SSC_RHR_RDAT_Pos                      (0)                                            /**< (SSC_RHR) Receive Data Position */
#define SSC_RHR_RDAT_Msk                      (0xFFFFFFFFU << SSC_RHR_RDAT_Pos)              /**< (SSC_RHR) Receive Data Mask */
#define SSC_RHR_RDAT(value)                   (SSC_RHR_RDAT_Msk & ((value) << SSC_RHR_RDAT_Pos))
#define SSC_RHR_Msk                           (0xFFFFFFFFUL)                                 /**< (SSC_RHR) Register Mask  */

/* -------- SSC_THR : (SSC Offset: 0x24) (/W 32) Transmit Holding Register -------- */

typedef union
{
  struct
  {
    uint32_t TDAT:32;                   /**< bit:  0..31  Transmit Data                                 */
  };
  uint32_t w;
} __SSC_THR_bits_t;

#define SSC_THR_TDAT_Pos                      (0)                                            /**< (SSC_THR) Transmit Data Position */
#define SSC_THR_TDAT_Msk                      (0xFFFFFFFFU << SSC_THR_TDAT_Pos)              /**< (SSC_THR) Transmit Data Mask */
#define SSC_THR_TDAT(value)                   (SSC_THR_TDAT_Msk & ((value) << SSC_THR_TDAT_Pos))
#define SSC_THR_Msk                           (0xFFFFFFFFUL)                                 /**< (SSC_THR) Register Mask  */

/* -------- SSC_RSHR : (SSC Offset: 0x30) (R/ 32) Receive Sync. Holding Register -------- */

typedef union
{
  struct
  {
    uint32_t RSDAT:16;                  /**< bit:  0..15  Receive Synchronization Data                  */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __SSC_RSHR_bits_t;

#define SSC_RSHR_RSDAT_Pos                    (0)                                            /**< (SSC_RSHR) Receive Synchronization Data Position */
#define SSC_RSHR_RSDAT_Msk                    (0xFFFFU << SSC_RSHR_RSDAT_Pos)                /**< (SSC_RSHR) Receive Synchronization Data Mask */
#define SSC_RSHR_RSDAT(value)                 (SSC_RSHR_RSDAT_Msk & ((value) << SSC_RSHR_RSDAT_Pos))
#define SSC_RSHR_Msk                          (0x0000FFFFUL)                                 /**< (SSC_RSHR) Register Mask  */

/* -------- SSC_TSHR : (SSC Offset: 0x34) (R/W 32) Transmit Sync. Holding Register -------- */

typedef union
{
  struct
  {
    uint32_t TSDAT:16;                  /**< bit:  0..15  Transmit Synchronization Data                 */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __SSC_TSHR_bits_t;

#define SSC_TSHR_TSDAT_Pos                    (0)                                            /**< (SSC_TSHR) Transmit Synchronization Data Position */
#define SSC_TSHR_TSDAT_Msk                    (0xFFFFU << SSC_TSHR_TSDAT_Pos)                /**< (SSC_TSHR) Transmit Synchronization Data Mask */
#define SSC_TSHR_TSDAT(value)                 (SSC_TSHR_TSDAT_Msk & ((value) << SSC_TSHR_TSDAT_Pos))
#define SSC_TSHR_Msk                          (0x0000FFFFUL)                                 /**< (SSC_TSHR) Register Mask  */

/* -------- SSC_RC0R : (SSC Offset: 0x38) (R/W 32) Receive Compare 0 Register -------- */

typedef union
{
  struct
  {
    uint32_t CP0:16;                    /**< bit:  0..15  Receive Compare Data 0                        */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __SSC_RC0R_bits_t;

#define SSC_RC0R_CP0_Pos                      (0)                                            /**< (SSC_RC0R) Receive Compare Data 0 Position */
#define SSC_RC0R_CP0_Msk                      (0xFFFFU << SSC_RC0R_CP0_Pos)                  /**< (SSC_RC0R) Receive Compare Data 0 Mask */
#define SSC_RC0R_CP0(value)                   (SSC_RC0R_CP0_Msk & ((value) << SSC_RC0R_CP0_Pos))
#define SSC_RC0R_Msk                          (0x0000FFFFUL)                                 /**< (SSC_RC0R) Register Mask  */

/* -------- SSC_RC1R : (SSC Offset: 0x3c) (R/W 32) Receive Compare 1 Register -------- */

typedef union
{
  struct
  {
    uint32_t CP1:16;                    /**< bit:  0..15  Receive Compare Data 1                        */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __SSC_RC1R_bits_t;

#define SSC_RC1R_CP1_Pos                      (0)                                            /**< (SSC_RC1R) Receive Compare Data 1 Position */
#define SSC_RC1R_CP1_Msk                      (0xFFFFU << SSC_RC1R_CP1_Pos)                  /**< (SSC_RC1R) Receive Compare Data 1 Mask */
#define SSC_RC1R_CP1(value)                   (SSC_RC1R_CP1_Msk & ((value) << SSC_RC1R_CP1_Pos))
#define SSC_RC1R_Msk                          (0x0000FFFFUL)                                 /**< (SSC_RC1R) Register Mask  */

/* -------- SSC_SR : (SSC Offset: 0x40) (R/ 32) Status Register -------- */

typedef union
{
  struct
  {
    uint32_t TXRDY:1;                   /**< bit:      0  Transmit Ready                                */
    uint32_t TXEMPTY:1;                 /**< bit:      1  Transmit Empty                                */
    uint32_t :2;                        /**< bit:   2..3  Reserved                                      */
    uint32_t RXRDY:1;                   /**< bit:      4  Receive Ready                                 */
    uint32_t OVRUN:1;                   /**< bit:      5  Receive Overrun                               */
    uint32_t :2;                        /**< bit:   6..7  Reserved                                      */
    uint32_t CP0:1;                     /**< bit:      8  Compare 0                                     */
    uint32_t CP1:1;                     /**< bit:      9  Compare 1                                     */
    uint32_t TXSYN:1;                   /**< bit:     10  Transmit Sync                                 */
    uint32_t RXSYN:1;                   /**< bit:     11  Receive Sync                                  */
    uint32_t :4;                        /**< bit: 12..15  Reserved                                      */
    uint32_t TXEN:1;                    /**< bit:     16  Transmit Enable                               */
    uint32_t RXEN:1;                    /**< bit:     17  Receive Enable                                */
    uint32_t :14;                       /**< bit: 18..31  Reserved                                      */
  };
  struct
  {
    uint32_t :8;                        /**< bit:   0..7  Reserved                                      */
    uint32_t CP:2;                      /**< bit:   8..9  Compare x                                     */
    uint32_t :22;                       /**< bit: 10..31  Reserved                                      */
  };
  uint32_t w;
} __SSC_SR_bits_t;

#define SSC_SR_TXRDY_Pos                      (0)                                            /**< (SSC_SR) Transmit Ready Position */
#define SSC_SR_TXRDY_Msk                      (0x1U << SSC_SR_TXRDY_Pos)                     /**< (SSC_SR) Transmit Ready Mask */
#define SSC_SR_TXEMPTY_Pos                    (1)                                            /**< (SSC_SR) Transmit Empty Position */
#define SSC_SR_TXEMPTY_Msk                    (0x1U << SSC_SR_TXEMPTY_Pos)                   /**< (SSC_SR) Transmit Empty Mask */
#define SSC_SR_RXRDY_Pos                      (4)                                            /**< (SSC_SR) Receive Ready Position */
#define SSC_SR_RXRDY_Msk                      (0x1U << SSC_SR_RXRDY_Pos)                     /**< (SSC_SR) Receive Ready Mask */
#define SSC_SR_OVRUN_Pos                      (5)                                            /**< (SSC_SR) Receive Overrun Position */
#define SSC_SR_OVRUN_Msk                      (0x1U << SSC_SR_OVRUN_Pos)                     /**< (SSC_SR) Receive Overrun Mask */
#define SSC_SR_CP0_Pos                        (8)                                            /**< (SSC_SR) Compare 0 Position */
#define SSC_SR_CP0_Msk                        (0x1U << SSC_SR_CP0_Pos)                       /**< (SSC_SR) Compare 0 Mask */
#define SSC_SR_CP1_Pos                        (9)                                            /**< (SSC_SR) Compare 1 Position */
#define SSC_SR_CP1_Msk                        (0x1U << SSC_SR_CP1_Pos)                       /**< (SSC_SR) Compare 1 Mask */
#define SSC_SR_TXSYN_Pos                      (10)                                           /**< (SSC_SR) Transmit Sync Position */
#define SSC_SR_TXSYN_Msk                      (0x1U << SSC_SR_TXSYN_Pos)                     /**< (SSC_SR) Transmit Sync Mask */
#define SSC_SR_RXSYN_Pos                      (11)                                           /**< (SSC_SR) Receive Sync Position */
#define SSC_SR_RXSYN_Msk                      (0x1U << SSC_SR_RXSYN_Pos)                     /**< (SSC_SR) Receive Sync Mask */
#define SSC_SR_TXEN_Pos                       (16)                                           /**< (SSC_SR) Transmit Enable Position */
#define SSC_SR_TXEN_Msk                       (0x1U << SSC_SR_TXEN_Pos)                      /**< (SSC_SR) Transmit Enable Mask */
#define SSC_SR_RXEN_Pos                       (17)                                           /**< (SSC_SR) Receive Enable Position */
#define SSC_SR_RXEN_Msk                       (0x1U << SSC_SR_RXEN_Pos)                      /**< (SSC_SR) Receive Enable Mask */
#define SSC_SR_Msk                            (0x00030F33UL)                                 /**< (SSC_SR) Register Mask  */
#define SSC_SR_CP_Pos                         (8)                                            /**< (SSC_SR Position) Compare x */
#define SSC_SR_CP_Msk                         (0x3U << SSC_SR_CP_Pos)                        /**< (SSC_SR Mask) CP */
#define SSC_SR_CP(value)                      (SSC_SR_CP_Msk & ((value) << SSC_SR_CP_Pos))

/* -------- SSC_IER : (SSC Offset: 0x44) (/W 32) Interrupt Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t TXRDY:1;                   /**< bit:      0  Transmit Ready Interrupt Enable               */
    uint32_t TXEMPTY:1;                 /**< bit:      1  Transmit Empty Interrupt Enable               */
    uint32_t :2;                        /**< bit:   2..3  Reserved                                      */
    uint32_t RXRDY:1;                   /**< bit:      4  Receive Ready Interrupt Enable                */
    uint32_t OVRUN:1;                   /**< bit:      5  Receive Overrun Interrupt Enable              */
    uint32_t :2;                        /**< bit:   6..7  Reserved                                      */
    uint32_t CP0:1;                     /**< bit:      8  Compare 0 Interrupt Enable                    */
    uint32_t CP1:1;                     /**< bit:      9  Compare 1 Interrupt Enable                    */
    uint32_t TXSYN:1;                   /**< bit:     10  Tx Sync Interrupt Enable                      */
    uint32_t RXSYN:1;                   /**< bit:     11  Rx Sync Interrupt Enable                      */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  struct
  {
    uint32_t :8;                        /**< bit:   0..7  Reserved                                      */
    uint32_t CP:2;                      /**< bit:   8..9  Compare x Interrupt Enable                    */
    uint32_t :22;                       /**< bit: 10..31  Reserved                                      */
  };
  uint32_t w;
} __SSC_IER_bits_t;

#define SSC_IER_TXRDY_Pos                     (0)                                            /**< (SSC_IER) Transmit Ready Interrupt Enable Position */
#define SSC_IER_TXRDY_Msk                     (0x1U << SSC_IER_TXRDY_Pos)                    /**< (SSC_IER) Transmit Ready Interrupt Enable Mask */
#define SSC_IER_TXEMPTY_Pos                   (1)                                            /**< (SSC_IER) Transmit Empty Interrupt Enable Position */
#define SSC_IER_TXEMPTY_Msk                   (0x1U << SSC_IER_TXEMPTY_Pos)                  /**< (SSC_IER) Transmit Empty Interrupt Enable Mask */
#define SSC_IER_RXRDY_Pos                     (4)                                            /**< (SSC_IER) Receive Ready Interrupt Enable Position */
#define SSC_IER_RXRDY_Msk                     (0x1U << SSC_IER_RXRDY_Pos)                    /**< (SSC_IER) Receive Ready Interrupt Enable Mask */
#define SSC_IER_OVRUN_Pos                     (5)                                            /**< (SSC_IER) Receive Overrun Interrupt Enable Position */
#define SSC_IER_OVRUN_Msk                     (0x1U << SSC_IER_OVRUN_Pos)                    /**< (SSC_IER) Receive Overrun Interrupt Enable Mask */
#define SSC_IER_CP0_Pos                       (8)                                            /**< (SSC_IER) Compare 0 Interrupt Enable Position */
#define SSC_IER_CP0_Msk                       (0x1U << SSC_IER_CP0_Pos)                      /**< (SSC_IER) Compare 0 Interrupt Enable Mask */
#define SSC_IER_CP1_Pos                       (9)                                            /**< (SSC_IER) Compare 1 Interrupt Enable Position */
#define SSC_IER_CP1_Msk                       (0x1U << SSC_IER_CP1_Pos)                      /**< (SSC_IER) Compare 1 Interrupt Enable Mask */
#define SSC_IER_TXSYN_Pos                     (10)                                           /**< (SSC_IER) Tx Sync Interrupt Enable Position */
#define SSC_IER_TXSYN_Msk                     (0x1U << SSC_IER_TXSYN_Pos)                    /**< (SSC_IER) Tx Sync Interrupt Enable Mask */
#define SSC_IER_RXSYN_Pos                     (11)                                           /**< (SSC_IER) Rx Sync Interrupt Enable Position */
#define SSC_IER_RXSYN_Msk                     (0x1U << SSC_IER_RXSYN_Pos)                    /**< (SSC_IER) Rx Sync Interrupt Enable Mask */
#define SSC_IER_Msk                           (0x00000F33UL)                                 /**< (SSC_IER) Register Mask  */
#define SSC_IER_CP_Pos                        (8)                                            /**< (SSC_IER Position) Compare x Interrupt Enable */
#define SSC_IER_CP_Msk                        (0x3U << SSC_IER_CP_Pos)                       /**< (SSC_IER Mask) CP */
#define SSC_IER_CP(value)                     (SSC_IER_CP_Msk & ((value) << SSC_IER_CP_Pos))

