zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/ssc.h
/* -------- SSC_IDR : (SSC Offset: 0x48) (/W 32) Interrupt Disable Register -------- */

typedef union
{
  struct
  {
    uint32_t TXRDY:1;                   /**< bit:      0  Transmit Ready Interrupt Disable              */
    uint32_t TXEMPTY:1;                 /**< bit:      1  Transmit Empty Interrupt Disable              */
    uint32_t :2;                        /**< bit:   2..3  Reserved                                      */
    uint32_t RXRDY:1;                   /**< bit:      4  Receive Ready Interrupt Disable               */
    uint32_t OVRUN:1;                   /**< bit:      5  Receive Overrun Interrupt Disable             */
    uint32_t :2;                        /**< bit:   6..7  Reserved                                      */
    uint32_t CP0:1;                     /**< bit:      8  Compare 0 Interrupt Disable                   */
    uint32_t CP1:1;                     /**< bit:      9  Compare 1 Interrupt Disable                   */
    uint32_t TXSYN:1;                   /**< bit:     10  Tx Sync Interrupt Enable                      */
    uint32_t RXSYN:1;                   /**< bit:     11  Rx Sync Interrupt Enable                      */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  struct
  {
    uint32_t :8;                        /**< bit:   0..7  Reserved                                      */
    uint32_t CP:2;                      /**< bit:   8..9  Compare x Interrupt Disable                   */
    uint32_t :22;                       /**< bit: 10..31  Reserved                                      */
  };
  uint32_t w;
} __SSC_IDR_bits_t;

#define SSC_IDR_TXRDY_Pos                     (0)                                            /**< (SSC_IDR) Transmit Ready Interrupt Disable Position */
#define SSC_IDR_TXRDY_Msk                     (0x1U << SSC_IDR_TXRDY_Pos)                    /**< (SSC_IDR) Transmit Ready Interrupt Disable Mask */
#define SSC_IDR_TXEMPTY_Pos                   (1)                                            /**< (SSC_IDR) Transmit Empty Interrupt Disable Position */
#define SSC_IDR_TXEMPTY_Msk                   (0x1U << SSC_IDR_TXEMPTY_Pos)                  /**< (SSC_IDR) Transmit Empty Interrupt Disable Mask */
#define SSC_IDR_RXRDY_Pos                     (4)                                            /**< (SSC_IDR) Receive Ready Interrupt Disable Position */
#define SSC_IDR_RXRDY_Msk                     (0x1U << SSC_IDR_RXRDY_Pos)                    /**< (SSC_IDR) Receive Ready Interrupt Disable Mask */
#define SSC_IDR_OVRUN_Pos                     (5)                                            /**< (SSC_IDR) Receive Overrun Interrupt Disable Position */
#define SSC_IDR_OVRUN_Msk                     (0x1U << SSC_IDR_OVRUN_Pos)                    /**< (SSC_IDR) Receive Overrun Interrupt Disable Mask */
#define SSC_IDR_CP0_Pos                       (8)                                            /**< (SSC_IDR) Compare 0 Interrupt Disable Position */
#define SSC_IDR_CP0_Msk                       (0x1U << SSC_IDR_CP0_Pos)                      /**< (SSC_IDR) Compare 0 Interrupt Disable Mask */
#define SSC_IDR_CP1_Pos                       (9)                                            /**< (SSC_IDR) Compare 1 Interrupt Disable Position */
#define SSC_IDR_CP1_Msk                       (0x1U << SSC_IDR_CP1_Pos)                      /**< (SSC_IDR) Compare 1 Interrupt Disable Mask */
#define SSC_IDR_TXSYN_Pos                     (10)                                           /**< (SSC_IDR) Tx Sync Interrupt Enable Position */
#define SSC_IDR_TXSYN_Msk                     (0x1U << SSC_IDR_TXSYN_Pos)                    /**< (SSC_IDR) Tx Sync Interrupt Enable Mask */
#define SSC_IDR_RXSYN_Pos                     (11)                                           /**< (SSC_IDR) Rx Sync Interrupt Enable Position */
#define SSC_IDR_RXSYN_Msk                     (0x1U << SSC_IDR_RXSYN_Pos)                    /**< (SSC_IDR) Rx Sync Interrupt Enable Mask */
#define SSC_IDR_Msk                           (0x00000F33UL)                                 /**< (SSC_IDR) Register Mask  */
#define SSC_IDR_CP_Pos                        (8)                                            /**< (SSC_IDR Position) Compare x Interrupt Disable */
#define SSC_IDR_CP_Msk                        (0x3U << SSC_IDR_CP_Pos)                       /**< (SSC_IDR Mask) CP */
#define SSC_IDR_CP(value)                     (SSC_IDR_CP_Msk & ((value) << SSC_IDR_CP_Pos))

/* -------- SSC_IMR : (SSC Offset: 0x4c) (R/ 32) Interrupt Mask Register -------- */

typedef union
{
  struct
  {
    uint32_t TXRDY:1;                   /**< bit:      0  Transmit Ready Interrupt Mask                 */
    uint32_t TXEMPTY:1;                 /**< bit:      1  Transmit Empty Interrupt Mask                 */
    uint32_t :2;                        /**< bit:   2..3  Reserved                                      */
    uint32_t RXRDY:1;                   /**< bit:      4  Receive Ready Interrupt Mask                  */
    uint32_t OVRUN:1;                   /**< bit:      5  Receive Overrun Interrupt Mask                */
    uint32_t :2;                        /**< bit:   6..7  Reserved                                      */
    uint32_t CP0:1;                     /**< bit:      8  Compare 0 Interrupt Mask                      */
    uint32_t CP1:1;                     /**< bit:      9  Compare 1 Interrupt Mask                      */
    uint32_t TXSYN:1;                   /**< bit:     10  Tx Sync Interrupt Mask                        */
    uint32_t RXSYN:1;                   /**< bit:     11  Rx Sync Interrupt Mask                        */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  struct
  {
    uint32_t :8;                        /**< bit:   0..7  Reserved                                      */
    uint32_t CP:2;                      /**< bit:   8..9  Compare x Interrupt Mask                      */
    uint32_t :22;                       /**< bit: 10..31  Reserved                                      */
  };
  uint32_t w;
} __SSC_IMR_bits_t;

#define SSC_IMR_TXRDY_Pos                     (0)                                            /**< (SSC_IMR) Transmit Ready Interrupt Mask Position */
#define SSC_IMR_TXRDY_Msk                     (0x1U << SSC_IMR_TXRDY_Pos)                    /**< (SSC_IMR) Transmit Ready Interrupt Mask Mask */
#define SSC_IMR_TXEMPTY_Pos                   (1)                                            /**< (SSC_IMR) Transmit Empty Interrupt Mask Position */
#define SSC_IMR_TXEMPTY_Msk                   (0x1U << SSC_IMR_TXEMPTY_Pos)                  /**< (SSC_IMR) Transmit Empty Interrupt Mask Mask */
#define SSC_IMR_RXRDY_Pos                     (4)                                            /**< (SSC_IMR) Receive Ready Interrupt Mask Position */
#define SSC_IMR_RXRDY_Msk                     (0x1U << SSC_IMR_RXRDY_Pos)                    /**< (SSC_IMR) Receive Ready Interrupt Mask Mask */
#define SSC_IMR_OVRUN_Pos                     (5)                                            /**< (SSC_IMR) Receive Overrun Interrupt Mask Position */
#define SSC_IMR_OVRUN_Msk                     (0x1U << SSC_IMR_OVRUN_Pos)                    /**< (SSC_IMR) Receive Overrun Interrupt Mask Mask */
#define SSC_IMR_CP0_Pos                       (8)                                            /**< (SSC_IMR) Compare 0 Interrupt Mask Position */
#define SSC_IMR_CP0_Msk                       (0x1U << SSC_IMR_CP0_Pos)                      /**< (SSC_IMR) Compare 0 Interrupt Mask Mask */
#define SSC_IMR_CP1_Pos                       (9)                                            /**< (SSC_IMR) Compare 1 Interrupt Mask Position */
#define SSC_IMR_CP1_Msk                       (0x1U << SSC_IMR_CP1_Pos)                      /**< (SSC_IMR) Compare 1 Interrupt Mask Mask */
#define SSC_IMR_TXSYN_Pos                     (10)                                           /**< (SSC_IMR) Tx Sync Interrupt Mask Position */
#define SSC_IMR_TXSYN_Msk                     (0x1U << SSC_IMR_TXSYN_Pos)                    /**< (SSC_IMR) Tx Sync Interrupt Mask Mask */
#define SSC_IMR_RXSYN_Pos                     (11)                                           /**< (SSC_IMR) Rx Sync Interrupt Mask Position */
#define SSC_IMR_RXSYN_Msk                     (0x1U << SSC_IMR_RXSYN_Pos)                    /**< (SSC_IMR) Rx Sync Interrupt Mask Mask */
#define SSC_IMR_Msk                           (0x00000F33UL)                                 /**< (SSC_IMR) Register Mask  */
#define SSC_IMR_CP_Pos                        (8)                                            /**< (SSC_IMR Position) Compare x Interrupt Mask */
#define SSC_IMR_CP_Msk                        (0x3U << SSC_IMR_CP_Pos)                       /**< (SSC_IMR Mask) CP */
#define SSC_IMR_CP(value)                     (SSC_IMR_CP_Msk & ((value) << SSC_IMR_CP_Pos))

/* -------- SSC_WPMR : (SSC Offset: 0xe4) (R/W 32) Write Protection Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t WPEN:1;                    /**< bit:      0  Write Protection Enable                       */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t WPKEY:24;                  /**< bit:  8..31  Write Protection Key                          */
  };
  uint32_t w;
} __SSC_WPMR_bits_t;

#define SSC_WPMR_WPEN_Pos                     (0)                                            /**< (SSC_WPMR) Write Protection Enable Position */
#define SSC_WPMR_WPEN_Msk                     (0x1U << SSC_WPMR_WPEN_Pos)                    /**< (SSC_WPMR) Write Protection Enable Mask */
#define SSC_WPMR_WPKEY_Pos                    (8)                                            /**< (SSC_WPMR) Write Protection Key Position */
#define SSC_WPMR_WPKEY_Msk                    (0xFFFFFFU << SSC_WPMR_WPKEY_Pos)              /**< (SSC_WPMR) Write Protection Key Mask */
#define SSC_WPMR_WPKEY(value)                 (SSC_WPMR_WPKEY_Msk & ((value) << SSC_WPMR_WPKEY_Pos))
#define   SSC_WPMR_WPKEY_PASSWD_Val           (0x535343U)                                    /**< (SSC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.  */
#define SSC_WPMR_WPKEY_PASSWD                 (SSC_WPMR_WPKEY_PASSWD_Val << SSC_WPMR_WPKEY_Pos)  /**< (SSC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. Position  */
#define SSC_WPMR_Msk                          (0xFFFFFF01UL)                                 /**< (SSC_WPMR) Register Mask  */

