zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/ssc.h
/* -------- SSC_WPSR : (SSC Offset: 0xe8) (R/ 32) Write Protection Status Register -------- */

typedef union
{
  struct
  {
    uint32_t WPVS:1;                    /**< bit:      0  Write Protection Violation Status             */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t WPVSRC:16;                 /**< bit:  8..23  Write Protect Violation Source                */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __SSC_WPSR_bits_t;

#define SSC_WPSR_WPVS_Pos                     (0)                                            /**< (SSC_WPSR) Write Protection Violation Status Position */
#define SSC_WPSR_WPVS_Msk                     (0x1U << SSC_WPSR_WPVS_Pos)                    /**< (SSC_WPSR) Write Protection Violation Status Mask */
#define SSC_WPSR_WPVSRC_Pos                   (8)                                            /**< (SSC_WPSR) Write Protect Violation Source Position */
#define SSC_WPSR_WPVSRC_Msk                   (0xFFFFU << SSC_WPSR_WPVSRC_Pos)               /**< (SSC_WPSR) Write Protect Violation Source Mask */
#define SSC_WPSR_WPVSRC(value)                (SSC_WPSR_WPVSRC_Msk & ((value) << SSC_WPSR_WPVSRC_Pos))
#define SSC_WPSR_Msk                          (0x00FFFF01UL)                                 /**< (SSC_WPSR) Register Mask  */

/** \brief SSC register offsets definitions */
#define SSC_CR_OFFSET                (0x00)         /**< (SSC_CR) Control Register Offset */
#define SSC_CMR_OFFSET               (0x04)         /**< (SSC_CMR) Clock Mode Register Offset */
#define SSC_RCMR_OFFSET              (0x10)         /**< (SSC_RCMR) Receive Clock Mode Register Offset */
#define SSC_RFMR_OFFSET              (0x14)         /**< (SSC_RFMR) Receive Frame Mode Register Offset */
#define SSC_TCMR_OFFSET              (0x18)         /**< (SSC_TCMR) Transmit Clock Mode Register Offset */
#define SSC_TFMR_OFFSET              (0x1C)         /**< (SSC_TFMR) Transmit Frame Mode Register Offset */
#define SSC_RHR_OFFSET               (0x20)         /**< (SSC_RHR) Receive Holding Register Offset */
#define SSC_THR_OFFSET               (0x24)         /**< (SSC_THR) Transmit Holding Register Offset */
#define SSC_RSHR_OFFSET              (0x30)         /**< (SSC_RSHR) Receive Sync. Holding Register Offset */
#define SSC_TSHR_OFFSET              (0x34)         /**< (SSC_TSHR) Transmit Sync. Holding Register Offset */
#define SSC_RC0R_OFFSET              (0x38)         /**< (SSC_RC0R) Receive Compare 0 Register Offset */
#define SSC_RC1R_OFFSET              (0x3C)         /**< (SSC_RC1R) Receive Compare 1 Register Offset */
#define SSC_SR_OFFSET                (0x40)         /**< (SSC_SR) Status Register Offset */
#define SSC_IER_OFFSET               (0x44)         /**< (SSC_IER) Interrupt Enable Register Offset */
#define SSC_IDR_OFFSET               (0x48)         /**< (SSC_IDR) Interrupt Disable Register Offset */
#define SSC_IMR_OFFSET               (0x4C)         /**< (SSC_IMR) Interrupt Mask Register Offset */
#define SSC_WPMR_OFFSET              (0xE4)         /**< (SSC_WPMR) Write Protection Mode Register Offset */
#define SSC_WPSR_OFFSET              (0xE8)         /**< (SSC_WPSR) Write Protection Status Register Offset */

/** \brief SSC register API structure */
typedef struct
{
  __O   __SSC_CR_bits_t                SSC_CR;        /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  __SSC_CMR_bits_t               SSC_CMR;       /**< Offset: 0x04 (R/W  32) Clock Mode Register */
  __I   uint8_t                        Reserved1[0x08];
  __IO  __SSC_RCMR_bits_t              SSC_RCMR;      /**< Offset: 0x10 (R/W  32) Receive Clock Mode Register */
  __IO  __SSC_RFMR_bits_t              SSC_RFMR;      /**< Offset: 0x14 (R/W  32) Receive Frame Mode Register */
  __IO  __SSC_TCMR_bits_t              SSC_TCMR;      /**< Offset: 0x18 (R/W  32) Transmit Clock Mode Register */
  __IO  __SSC_TFMR_bits_t              SSC_TFMR;      /**< Offset: 0x1C (R/W  32) Transmit Frame Mode Register */
  __I   __SSC_RHR_bits_t               SSC_RHR;       /**< Offset: 0x20 (R/   32) Receive Holding Register */
  __O   __SSC_THR_bits_t               SSC_THR;       /**< Offset: 0x24 ( /W  32) Transmit Holding Register */
  __I   uint8_t                        Reserved2[0x08];
  __I   __SSC_RSHR_bits_t              SSC_RSHR;      /**< Offset: 0x30 (R/   32) Receive Sync. Holding Register */
  __IO  __SSC_TSHR_bits_t              SSC_TSHR;      /**< Offset: 0x34 (R/W  32) Transmit Sync. Holding Register */
  __IO  __SSC_RC0R_bits_t              SSC_RC0R;      /**< Offset: 0x38 (R/W  32) Receive Compare 0 Register */
  __IO  __SSC_RC1R_bits_t              SSC_RC1R;      /**< Offset: 0x3C (R/W  32) Receive Compare 1 Register */
  __I   __SSC_SR_bits_t                SSC_SR;        /**< Offset: 0x40 (R/   32) Status Register */
  __O   __SSC_IER_bits_t               SSC_IER;       /**< Offset: 0x44 ( /W  32) Interrupt Enable Register */
  __O   __SSC_IDR_bits_t               SSC_IDR;       /**< Offset: 0x48 ( /W  32) Interrupt Disable Register */
  __I   __SSC_IMR_bits_t               SSC_IMR;       /**< Offset: 0x4C (R/   32) Interrupt Mask Register */
  __I   uint8_t                        Reserved3[0x94];
  __IO  __SSC_WPMR_bits_t              SSC_WPMR;      /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   __SSC_WPSR_bits_t              SSC_WPSR;      /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
} ssc_registers_t;
/** @}  end of Synchronous Serial Controller */

#endif /* _PIC32CZ_CA70_SSC_COMPONENT_H_ */
